---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.RenderFailures.ProhibitDeletionLightSource
source: html/e70be201-fd25-f690-ce57-26b9c0315919.htm
---
# Autodesk.Revit.DB.BuiltInFailures.RenderFailures.ProhibitDeletionLightSource Property

The light source cannot be deleted with UI.

## Syntax (C#)
```csharp
public static FailureDefinitionId ProhibitDeletionLightSource { get; }
```